Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/local_and_regional_government/local_government_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Article 28A of the Irish Constitution (Bunreacht na hEireann) recognises the role of local government in providing democratic representation of local communities
ga: Aithníonn Airteagal 28A de Bunreacht na hÉireann ról an rialtais áitiúil i dtaca le hionadaíocht dhaonlathach a dhéanamh ar phobail áitiúla na tíre

source: This recognition endorses the democratic representative role of local government and guarantees local elections at least every five years
ga: Aitheantas é seo a thacaíonn le ról an rialtais áitiúla ó thaobh ionadaíochta daonlathaí de agus a chinntíonn go mbeidh toghcháin áitiúla in Éirinn ar a laghad uair amháin gach cúig bliana

source: Local government not only represents the people in the local communities, but also perform a number of important functions
ga: Ní hé amháin go ndéanann an rialtas áitiúil ionadaíocht ar mhuintir na bpobal áitiúil, ach bíonn feidhmeanna tábhachtacha aige freisin sa cheantar áitiúil

source: Local government has therefore both a representational and an operational role, with responsibility for a range of services
ga: Mar sin, tá ról atá ionadaíoch agus feidhmeach ag an rialtas áitiúil, agus freagracht air as réimse seirbhísí

source: It operates through a network of directly elected local authorities which provide, among other things, a forum for the democratic representation of local communities, giving expression to local identity, identifying local concerns and setting local priorities
ga: Feidhmíonn sé trí líonra d’údaráis áitiúla a thoghtar go díreach agus a sholáthraíonn, i measc nithe eile, fóram le haghaidh ionadaíocht dhaonlathach na bpobal áitiúil, maraon le féiniúlacht áitiúil a chur in iúl, riachtanais áitiúla a aimsiú agus tosaíochtaí áitiúla a shocrú

source: To carry out their functions, local authorities are entrusted with certain powers
ga: Lena bhfeidhmeanna a chur i gcrích, tugtar cumhachtaí áirithe d’údaráis áitiúla

source: The primary legislation applying to local authorities is the Local Government Act 2001
ga: Is é an Achta um Rialtais Áitiúil 2001 an reachtaíocht phríomhúil a bhaineann le húdaráis áitiúla

source: In October 2012 the Government published Putting People First- Action Programme for Effective Local Government (pdf) which sets out Government policy for reforms across all the main areas of local government
ga: I nDeireadh Fómhair 2012 d'fhoilsigh an Rialtas Daoine a Chur chun Tosaigh - Clár Gníomhaíochta um Rialtas Áitiúil Éifeachtach (pdf). Leagann sé amach beartas an Rialtais le haghaidh leasuithe ar fud na réimsí is mó an rialtais áitiúil

source: The Local Government Reform Act 2014 amended the 2001 Act
ga: Leasaítear an tAcht um Athchóiriú an Rialtais Áitiúil 2014 an tAcht 2001

source: With effect from June 2014, the town and borough councils were replaced by a comprehensive system of municipal districts and a number of local authorities were merged
ga: Le héifeacht ó Mheitheamh 2014, cuir córas cuimsitheach ceantair chathrach in ionad na comhairlí baile agus buirge, agus cuireadh chomhcheangal roinnt údarás áitiúla

source: Further information on local government reform is available on the Department of Housing, Planning, Community and Local Government website
ga: Tá tuilleadh eolais maidir le hathchóiriú an rialtais áitiúil ar fáil ar an láithreán gréasáin Roinn Tithíochta, Pleanála, Pobail agus Rialtais Áitiúil
